Ran Plan for dir: `diplom/main` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis-data/repos/dreadsolnce/netology_courses/41/default/diplom/main/my-infrastructure-default.tfplan"' in '/atlantis-data/repos/dreadsolnce/netology_courses/41/default/diplom/main': exit status 1
tls_private_key.key: Refreshing state... [id=563e0c635332a28627dc2f94b2cf3f1ac0c65808]
data.template_file.cloudinit-vm: Reading...
data.template_file.cloudinit-vm: Read complete after 0s [id=4f748a2190f0341dc115639621c029ae892f4b1bd601d18bb780ddd4e3a30991]
yandex_iam_service_account.gitlab: Refreshing state... [id=ajen6022v7m053ssffa2]
data.yandex_compute_image.image: Reading...
yandex_vpc_subnet.test: Refreshing state... [id=e9bgc180fjttk3nk2d7h]
yandex_vpc_network.vpc: Refreshing state... [id=enpcjqvjd35viej1hje3]
yandex_vpc_address.public_ip_static: Refreshing state... [id=e9bjcqkqv5kmn9s09u3l]
yandex_container_registry.registry: Refreshing state... [id=crpcrvi5pmcloptn3n3c]
data.yandex_compute_image.image: Read complete after 0s [id=fd875m9ethhftod6n2vd]
yandex_vpc_route_table.rt: Refreshing state... [id=enplmr2cdie6id987hpa]
yandex_resourcemanager_folder_iam_member.role_registry["k8s.clusters.agent"]: Refreshing state... [id=b1gdmpusv51ippn2psip/k8s.clusters.agent/serviceAccount:ajen6022v7m053ssffa2]
yandex_resourcemanager_folder_iam_member.role_registry["container-registry.images.pusher"]: Refreshing state... [id=b1gdmpusv51ippn2psip/container-registry.images.pusher/serviceAccount:ajen6022v7m053ssffa2]
yandex_vpc_subnet.sunbets["public"]: Refreshing state... [id=e9bc41e89o27uaf3fec5]
yandex_vpc_subnet.sunbets["d"]: Refreshing state... [id=fl8rkauolrum1hih52m7]
yandex_vpc_subnet.sunbets["b"]: Refreshing state... [id=e2l82h0gvife2r5nmeh4]
yandex_vpc_subnet.sunbets["a"]: Refreshing state... [id=e9basn83ktmqf4dd1cfj]
yandex_compute_instance.master-node["master1"]: Refreshing state... [id=fhm0vvirfq8nscl357k3]
yandex_compute_instance.master-node["master2"]: Refreshing state... [id=epd1pn2pl2dfdr5ijfbv]
yandex_compute_instance.master-node["master3"]: Refreshing state... [id=fv434p5du7f2ntg1gksv]
local_file.hosts_templatefile: Refreshing state... [id=5b124980c835cb816ba5f65a35f7643a5e5c12d9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # local_file.hosts_templatefile will be created
  + resource "local_file" "hosts_templatefile" {
      + content              = <<-EOT
            [kube_control_plane]
            master1 ansible_host=192.168.1.11    ip=192.168.1.11  etcd_member_name=etcd1
            master2 ansible_host=192.168.2.22    ip=192.168.2.22  etcd_member_name=etcd2
            master3 ansible_host=192.168.3.33    ip=192.168.3.33  etcd_member_name=etcd3
            
            [etcd:children]
            kube_control_plane
            
            [calico_rr]
            
            [k8s_cluster:children]
            kube_control_plane
            calico_rr
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "/atlantis-data/repos/dreadsolnce/netology_courses/41/default/diplom/main/hosts.ini"
      + id                   = (known after apply)
    }

  # yandex_vpc_subnet.test will be destroyed
  # (because yandex_vpc_subnet.test is not in configuration)
  - resource "yandex_vpc_subnet" "test" {
      - created_at     = "2026-03-13T03:46:58Z" -> null
      - folder_id      = "b1gdmpusv51ippn2psip" -> null
      - id             = "e9bgc180fjttk3nk2d7h" -> null
      - labels         = {} -> null
      - name           = "test" -> null
      - network_id     = "enpcjqvjd35viej1hje3" -> null
      - v4_cidr_blocks = [
          - "10.0.0.0/24",
        ] -> null
      - v6_cidr_blocks = [] -> null
      - zone           = "ru-central1-a" -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ Абсолютный_путь                                              = {
      ~ abspath = "/home/kvl/netology_courses/diplom/main" -> "/atlantis-data/repos/dreadsolnce/netology_courses/41/default/diplom/main"
        # (1 unchanged attribute hidden)
    }
  ~ Основные_скрипты_запуска                                     = {
      ~ file_app        = "/home/kvl/netology_courses/diplom/main/conf/app/app.sh" -> "/atlantis-data/repos/dreadsolnce/netology_courses/41/default/diplom/main/conf/app/app.sh"
      ~ file_kubespray  = "/home/kvl/netology_courses/diplom/main/conf/kubespray/kubespray.sh" -> "/atlantis-data/repos/dreadsolnce/netology_courses/41/default/diplom/main/conf/kubespray/kubespray.sh"
      ~ file_prometheus = "/home/kvl/netology_courses/diplom/main/conf/grafana/kube-prometheus.sh" -> "/atlantis-data/repos/dreadsolnce/netology_courses/41/default/diplom/main/conf/grafana/kube-prometheus.sh"
    }
╷
│ Error: Error in function call
│ 
│   on __main.tf line 108, in data "template_file" "cloudinit-bastion":
│  108:         file_privkey          = fileexists(var.file_privkey) ? filebase64(var.file_privkey) : ""
│     ├────────────────
│     │ while calling fileexists(path)
│ 
│ Call to function "fileexists" failed: failed to stat (sensitive value).
╵
╷
│ Error: Error in function call
│ 
│   on __main.tf line 109, in data "template_file" "cloudinit-bastion":
│  109:         file_fullchain        = fileexists(var.file_fullchain) ? filebase64(var.file_fullchain) : ""
│     ├────────────────
│     │ while calling fileexists(path)
│ 
│ Call to function "fileexists" failed: failed to stat (sensitive value).
╵
╷
│ Error: Error in function call
│ 
│   on __main.tf line 110, in data "template_file" "cloudinit-bastion":
│  110:         file_chain            = fileexists(var.file_chain) ? filebase64(var.file_chain) : ""
│     ├────────────────
│     │ while calling fileexists(path)
│ 
│ Call to function "fileexists" failed: failed to stat (sensitive value).
╵
╷
│ Error: Error in function call
│ 
│   on __main.tf line 130, in data "template_file" "cloudinit-bastion":
│  130:     file_privkey              = fileexists(var.file_privkey) ? filebase64(var.file_privkey) : ""
│     ├────────────────
│     │ while calling fileexists(path)
│ 
│ Call to function "fileexists" failed: failed to stat (sensitive value).
╵
╷
│ Error: Error in function call
│ 
│   on __main.tf line 131, in data "template_file" "cloudinit-bastion":
│  131:     file_fullchain            = fileexists(var.file_fullchain) ? filebase64(var.file_fullchain) : ""
│     ├────────────────
│     │ while calling fileexists(path)
│ 
│ Call to function "fileexists" failed: failed to stat (sensitive value).
╵
╷
│ Error: Error in function call
│ 
│   on __main.tf line 132, in data "template_file" "cloudinit-bastion":
│  132:     file_chain                = fileexists(var.file_chain) ? filebase64(var.file_chain) : ""
│     ├────────────────
│     │ while calling fileexists(path)
│ 
│ Call to function "fileexists" failed: failed to stat (sensitive value).
╵

```
</details>